## 模块化编程
在Java9中引入了一种新的特性——模块化编程。该特性影响了，从Java诞生以来的代码组织结构，解决了以往结构中存在的部分缺陷。

## 模块化带来的优势
1. 更强的封装特性
1. 可靠的配置
1. 更高效的部署和效率

### 更强的封装特性。Java9之前，当希望某模块只供内部使用时，开发者往往会遇到障碍。一旦包的使用者使用利用某种方法使用了设计为内部使用的模块时，
就限制了包创建者的灵活性。当想使用更好的内部模块时，因为该模块已经被客户使用，为了兼容性，创建者可能不得不在新设计不再使用旧模块时保留它。

### 可靠的配置。由于Java9之前的classpath工作方式，无法在部署应用时，检查环境中是否包含所有应用需要的类，直到应用运行时调用该类，如果无法加载，才抛出
NoClassDefFoundError.

### 更高效的部署和效率.在Java9之前部署应用时，不得不包含整个jre。即使其中有很多类是应用并不需要的。这不仅导致更大的发布文件，同时jvm会加载大量并未
使用的类，浪费内存，降低效率。

## 编写一个自己的模块
1.安装Java9.可以使用openjdk.下载地址http://jdk.java.net/9
